cases/Day-1_Tutorial/squareChannelConv_robin_constantFlux/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;// scales to mm 

vertices
(
    //square channle
    (0 0 0) // 0
    (2 0 0) // 1
    (2 2 0) // 2
    (0 2 0) // 3
    (0 0 30) // 4
    (2 0 30) // 5
    (2 2 30) // 6
    (0 2 30) // 7

    // square section
    (0 0 6) // 8
    (2 0 6) // 9
    (2 2 6) // 10
    (0 2 6) // 11
    (0 0 24) // 12
    (2 0 24) // 13
    (2 2 24) // 14
    (0 2 24) // 15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (20 20 30) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (20 20 90) simpleGrading (1 1 1)
    hex (12 13 14 15 4 5 6 7) (20 20 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (12 13 5 4)
        );
    }

    heater
    {
        type wall;
        faces
        (
            (8 9 13 12)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 2 10 11)
            (11 10 14 15)
            (15 14 6 7)
        );
    }

    front
    {
        type wall;
        faces
        (
            (1 9 10 2)
            (9 13 14 10)
            (13 5 6 14)
        );
    }

    back
    {
        type wall;
        faces
        (
            (0 8 11 3)
            (8 12 15 11)
            (12 4 7 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
